output/function-compose-type-cut--demo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-28 Thu 22:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>function compose, type cut, and the algebra of logic</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="谢宇恒 / XIE Yuheng" />
<link rel="stylesheet" href="../css/org-page-no-toc.css"/>
</head>
<body>
<div id="content">
<h1 class="title">function compose, type cut, and the algebra of logic</h1>
<hr  />

<ul class="org-ul">
<li><p>in the chiso, natural deduction iso to lambda calculus</p><p>but what dose sequent calculus iso to ?</p></li></ul>

<hr  />

<ul class="org-ul">
<li><p><p></p><p>mini table</p><p></p></p><p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">minimalist</th></p><p><th scope="col" class="org-left">hiskimplet</th></p><p><th scope="col" class="org-left">type system</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">scheme</td></p><p><td class="org-left">one week</td></p><p><td class="org-left">dynamic</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">forth</td></p><p><td class="org-left">one weekend</td></p><p><td class="org-left">non !!!</td></p><p></tr></p><p></tbody></p><p></table></p></li></ul>

<hr  />

<ul class="org-ul">
<li><p>learn to implement forth in Y minutes</p><p></p><p><ul class="org-ul"></p><p><li><p><p></p><p>data-stack</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">&gt; <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">data</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">data</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">data</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p></pre></p><p></div></p></li></p><p></p><p><li><p><p></p><p>return-stack</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">       <span style="color: #f92672; font-weight: bold;">(jo)</span></p><p>       <span style="color: #f92672; font-weight: bold;">(jo)</span>        <span style="color: #f92672; font-weight: bold;">(jo)</span></p><p>| <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #f92672; font-weight: bold;">(jo)</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #f92672; font-weight: bold;">(jo)</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #f92672; font-weight: bold;">(jo)</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p>       <span style="color: #f92672; font-weight: bold;">(jo)</span>        <span style="color: #f92672; font-weight: bold;">(jo)</span>        <span style="color: #f92672; font-weight: bold;">(jo)</span></p><p>                               <span style="color: #f92672; font-weight: bold;">(jo)</span></p><p></pre></p><p></div></p></li></p><p></p><p><li><p><p></p><p>in forth</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">sq</span>        dup mul <span style="color: #ffff00; font-weight: bold;">;</span></p><p><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">power4</span>    sq sq   <span style="color: #ffff00; font-weight: bold;">;</span></p><p></pre></p><p></div></p></li></p><p></p><p><li><p><p></p><p>with 4 in data-stack</p><p>call power4</p><p></p></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">&gt; <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">4</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">| <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">(sq)</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p>       <span style="color: #ef5939; font-weight: bold;">(sq)</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">       <span style="color: #ef5939; font-weight: bold;">(sq)</span></p><p>| <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">(sq)</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">(dup)</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p>                   <span style="color: #ef5939; font-weight: bold;">(mul)</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">       <span style="color: #ef5939; font-weight: bold;">(sq)</span>        <span style="color: #ef5939; font-weight: bold;">(dup)</span></p><p>| <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">(sq)</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">(mul)</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">&gt; <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">4</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">4</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack"><span style="color: #83EA83; font-weight: bold;">:tail-call</span> <span style="color: #ef5939; font-weight: bold;">(mul)</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">&gt; <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">16</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack"><span style="color: #83EA83; font-weight: bold;">:tail-call</span> <span style="color: #ef5939; font-weight: bold;">(sq)</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">| <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">(dup)</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p>       <span style="color: #ef5939; font-weight: bold;">(mul)</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">       <span style="color: #ef5939; font-weight: bold;">(dup)</span></p><p>| <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">(mul)</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">&gt; <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">16</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">16</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack"><span style="color: #83EA83; font-weight: bold;">:tail-call</span> <span style="color: #ef5939; font-weight: bold;">(mul)</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">&gt; <span style="color: #ae81ff; font-weight: bold;">--</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">256</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">| <span style="color: #ae81ff; font-weight: bold;">--</span></p><p></pre></p><p></div></p><p><hr  /></p></li></p><p></p><p><li><p><b>[ threaded code interpreter, explained ! ]</b></p></li></ul></p></li></ul>

<hr  />

<ul class="org-ul">
<li><p><p></p><p>why call it 'compose' ?</p><p></p></p><p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">h</span> f g <span style="color: #ffff00; font-weight: bold;">;</span></p><p></pre></p><p></div></p><p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">  f    g</p><p>A <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> B <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> C</p><p> \___&gt;___/</p><p>     h</p><p></pre></p><p></div></p><p></p><p><ul class="org-ul"></p><p><li><p><b>[ function compose, explained ! ]</b></p></li></ul></p></li></ul>

<hr  />

<ul class="org-ul">
<li><p><p></p><p>it is plain to see how a type system of forth could be !</p><p></p></p><p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">dup<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span><span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:t</span> <span style="color: #a6e22e;">:t</span><span style="color: #696969;">)</span></p><p>mul<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>int int <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> int<span style="color: #696969;">)</span></p><p>sq <span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>int <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> int<span style="color: #696969;">)</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #a6e22e;">:t</span> <span style="color: #a6e22e;">:t</span>     int</p><p>----- * -------</p><p> <span style="color: #a6e22e;">:t</span>     int int</p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">&lt;unify&gt;</span> <span style="color: #a6e22e;">:t</span> = int<span style="color: #696969;">)</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">int</p><p>---</p><p>int</p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">so we have</p><p>sq <span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span>int <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> int<span style="color: #696969;">)</span></p><p></pre></p><p></div></p><p></p><p><ul class="org-ul"></p><p><li><p><b>[ type cut, explained ? ]</b></p></li></p><p></p><p><li><p>but why call it 'cut' ?</p></li></ul></p></li></ul>

<hr  />

<ul class="org-ul">
<li><p>'the algebra of logic' first</p><p></p><p><ul class="org-ul"></p><p><li><p><p></p><p>an example of 'product'</p><p></p></p><p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">f<span style="color: #FFA23D;"> : </span>A B <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> C D</p><p>g<span style="color: #FFA23D;"> : </span>D F <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> G H</p><p>----------------</p><p>?<span style="color: #FFA23D;"> : </span>F A B <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> C G H</p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">F A B</p><p>      &lt;- f</p><p>F C D</p><p>      &lt;- 1-2-swap</p><p>C D F</p><p>      &lt;- g</p><p>C G H</p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">    f       <span style="color: #FFA23D;"> : </span>A B <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> C D</p><p>    g       <span style="color: #FFA23D;"> : </span>D F <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> G H</p><p>-----------------------------</p><p>f 1-2-swap g<span style="color: #FFA23D;"> : </span>F A B <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> C G H</p><p></pre></p><p></div></p></li></p><p></p><p><li><p><p></p><p>another example of 'product'</p><p></p></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">f<span style="color: #FFA23D;"> : </span>A B <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> C D</p><p>g<span style="color: #FFA23D;"> : </span>D F <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> G H</p><p>--------------------</p><p>?<span style="color: #FFA23D;"> : </span>A B D F <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> C D G H</p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">A B D F</p><p>      &lt;- g</p><p>A B G H</p><p>      &lt;- 2-2-swap</p><p>G H A B</p><p>      &lt;- f</p><p>G H C D</p><p>      &lt;- 2-2-swap</p><p>C D G H</p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">         f           <span style="color: #FFA23D;"> : </span>A B <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> C D</p><p>         g           <span style="color: #FFA23D;"> : </span>D F <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> G H</p><p>------------------------------------------</p><p>g 2-2-swap f 2-2-swap<span style="color: #FFA23D;"> : </span>A B D F <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> C D G H</p><p></pre></p><p></div></p><p><hr  /></p></li></p><p></p><p><li><p><p></p><p>production</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">C D   G H</p><p>--- * ---</p><p>A B   D F</p><p></p><p>free to do permutation</p><p>product is not just a '*'</p><p>plus also is not just a '<span style="color: #66d9ef; font-weight: bold;">+</span>'</p><p></pre></p><p></div></p></li></p><p></p><p><li><p><p></p><p>another example of product</p><p></p></p><p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">f<span style="color: #FFA23D;"> : </span>A</p><p>g<span style="color: #FFA23D;"> : </span>B</p><p>---------</p><p>f g<span style="color: #FFA23D;"> : </span>A B</p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">f<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> A<span style="color: #696969;">)</span></p><p>g<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> B<span style="color: #696969;">)</span></p><p>--------------</p><p>f g<span style="color: #FFA23D;"> : </span><span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> A B<span style="color: #696969;">)</span></p><p></pre></p><p></div></p></li></p><p></p><p><li><p><b>[ the algebra of logic, explained ? ]</b></p></li></ul></p></li></ul>

<hr  />

<ul class="org-ul">
<li><p>chiso as an iso of 2-cat</p><p>(a pair of functors that are reverse to each other)</p><p>(only heuristiclly)</p><p></p><p><ul class="org-ul"></p><p><li><p><p></p><p>chiso</p><p></p></p><p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-cicada-language">deduction system    ~~~===    language to record</p><p>  <span style="color: #b0b1a3;">(</span>i.e. logic<span style="color: #b0b1a3;">)</span>               meta data of function</p><p>                                <span style="color: #b0b1a3;">(</span>i.e. type<span style="color: #b0b1a3;">)</span></p><p>      <span style="color: #b0b1a3;">|</span>                     <span style="color: #93a8c6;">[</span>for runtime safety<span style="color: #93a8c6;">]</span></p><p>      <span style="color: #b0b1a3;">|</span></p><p>      <span style="color: #b0b1a3;">|</span>                              <span style="color: #b0b1a3;">|</span></p><p>      <span style="color: #b0b1a3;">|</span>                              <span style="color: #b0b1a3;">|</span></p><p>      <span style="color: #b0b1a3;">|</span>                              <span style="color: #b0b1a3;">|</span></p><p></p><p>language to record  ~~~===  programming language</p><p> deduction steps              <span style="color: #b0b1a3;">(</span>i.e. function<span style="color: #b0b1a3;">)</span></p><p>  <span style="color: #b0b1a3;">(</span>i.e. proof<span style="color: #b0b1a3;">)</span></p><p><span style="color: #93a8c6;">[</span>for human communication<span style="color: #93a8c6;">]</span></p><p></pre></p><p></div></p></li></p><p></p><p><li><p><p></p><p>natural deduction</p><p></p></p><p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-cicada-language">natural deduction</p><p></p><p>      <span style="color: #b0b1a3;">|</span></p><p>      <span style="color: #b0b1a3;">|</span></p><p>      <span style="color: #b0b1a3;">|</span></p><p>                      decides</p><p>a language to record ========&gt; syntax of lambda calculus</p><p>    proof by ND                <span style="color: #b0b1a3;">(</span>prefix application syntax<span style="color: #b0b1a3;">)</span></p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">x<span style="color: #FFA23D;"> : </span>A <span style="color: #a6e22e;">:-</span> m<span style="color: #FFA23D;"> : </span>B</p><p>---------------- <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> intro<span style="color: #696969;">)</span></p><p>&#955; x . m<span style="color: #FFA23D;"> : </span>A <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> B</p><p></pre></p><p></div></p><p><hr  /></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-scheme">m<span style="color: #FFA23D;"> : </span>A <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> B</p><p>n<span style="color: #FFA23D;"> : </span>A</p><p>----------- <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> elim<span style="color: #696969;">)</span></p><p><span style="color: #696969;">(</span>m n<span style="color: #696969;">)</span><span style="color: #FFA23D;"> : </span>B</p><p></pre></p><p></div></p></li></p><p></p><p><li><p><p></p><p>sequent calculus</p><p></p></p><p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-cicada-language">sequent calculus</p><p></p><p>      <span style="color: #b0b1a3;">|</span></p><p>      <span style="color: #b0b1a3;">|</span></p><p>      <span style="color: #b0b1a3;">|</span></p><p>                      decides</p><p>a language to record ========&gt; postfix composition syntax</p><p>    proof by SC</p><p></pre></p><p></div></p></li></ul></p></li></ul>

<hr  />

<ul class="org-ul">
<li><p>about my implementations</p><p></p><p><ul class="org-ul"></p><p><li><p>sequent1 : implemented by term-rewriting-system</p></li></p><p></p><p><li><p>sequent0 : stack-based implementation</p></li></p><p></p><p><li><p><p></p><p>forth to sequent</p><p>add two more stacks</p><p>and enrich the data structure</p><p></p></p><p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">forth</th></p><p><th scope="col" class="org-left">sequent0</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">data-stack</td></p><p><td class="org-left">data-stack</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">return-stack</td></p><p><td class="org-left">return-stack (compose) (cut)</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">binding-stack (commit) (undo)</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">goal-stack (cover) (unify)</td></p><p></tr></p><p></tbody></p><p></table></p></li></p><p></p><p><li><p>binding-stack &amp; goal-stack</p><p>just like prolog VM without backtracing</p><p><ul class="org-ul"></p><p><li><p>cover as</p><p>the poset structure of the subsumption-lattice</p></li></p><p><li><p>unify as</p><p>the meet operation (greatest lower bound)</p><p>of the subsumption-lattice</p></li></ul></p></li></ul></p></li></ul>

<hr  />

<ul class="org-ul">
<li><p>example program</p></li></ul>

<hr  />

<ul class="org-ul">
<li><p>example of proof</p></li></ul>

<hr  />
</div>
<div id="postamble" class="status">
<p class="author">Author: 谢宇恒 / XIE Yuheng</p>
<p class="date">Created: 2017-09-28 Thu 22:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
